Repository: juliano-zorzolli-macedo/flutter_example
Catalog: apps/ui_catalog/lib/l10n/app_*.arb
Languages: pt, zh

# appTitle
source: DS Catalog
pt: Catálogo DS
zh: 设计系统目录

# menuFundamentals
source: Fundamentals
pt: Fundamentos
zh: 基础 (Token)

# menuColorsTitle
source: Colors & Palette
pt: Cores & Paleta
zh: 颜色和调色板

# menuColorsSubtitle
source: Brand identity, backgrounds and status
pt: Identidade visual, fundos e status
zh: 主要颜色、背景和状态

# menuComponents
source: Components
pt: Componentes
zh: 组件

# menuChatTitle
source: Chat & Messages
pt: Chat & Mensagens
zh: 聊天和消息

# menuChatSubtitle
source: Bubbles, avatars and chat lists
pt: Bolhas, avatars e lista de conversas
zh: 气泡、头像和对话列表

# screenColorsTitle
source: Color Palette
pt: Paleta de Cores
zh: 调色板

# colorGroupBrand
source: Brand & Primary
pt: Marca & Principal
zh: 品牌与主色

# colorGroupBackgrounds
source: Surfaces & Backgrounds
pt: Superfícies & Fundos
zh: 表面与背景

# colorGroupMessages
source: Chat Bubbles
pt: Balões de Chat
zh: 聊天气泡

# colorGroupText
source: Typography & Icons
pt: Tipografia & Ícones
zh: 排版与图标

# screenChatTitle
source: Chat Components
pt: Componentes de Chat
zh: 聊天组件

# sectionListTiles
source: Conversation List
pt: Listagem de Conversas
zh: 对话列表

# sectionBubbles
source: Message Bubbles
pt: Balões de Mensagem
zh: 消息气泡

# exampleName1
source: Chaves
zh: 查维斯

# exampleMessage1
source: It is it is it is
pt: Isso isso isso
zh: 是的是的是的

# exampleName2
source: Mr. Raymond
pt: Seu Madruga
zh: 雷蒙先生

# exampleMessage2
source: I don't give you another one just because...
pt: Só não te dou outra porque...
zh: 我不给你另一个只是因为...

# exampleMessageReceived
source: Hello! This is the receiver bubble.
pt: Olá! Este é o balão de quem recebe.
zh: 你好！这是接收者的气泡。

# exampleMessageSent
source: And this is the sender bubble (me).
pt: E este é o balão de quem envia (eu).
zh: 这是发送者的气泡（我）。

# exampleMessageLong
source: Bubble with long text to test line breaking and responsive layout in Flutter.
pt: Balão com texto longo para testar quebra de linha e layout responsivo no Flutter.
zh: 带有长文本的气泡，用于测试 Flutter 中的换行和响应式布局。
